app/Views/doctorProfile/index.php

SELECT *
FROM `doctor`
WHERE `doctor_id` = '4'
 LIMIT 1
---
        session()->regenerate();
        $doctor_id = session()->get('doctor_id');
        $doctorModel = new \App\Models\doctorModel();
        $user_info = $doctorModel->where('doctor_id', $doctor_id)->first();